In [1]:
#Correção de Valores Nulos na Base

In [2]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer

In [3]:
df = pd.read_csv('D:/OneDrive/OneDrive - Etec Centro Paula Souza/Databases/credit_data.csv')
df.columns = ['id', 'salario', 'idade', 'emprestimo', 'aprovado']

In [4]:
print(df)

        id       salario      idade   emprestimo  aprovado
0        1  66155.925095  59.017015  8106.532131         0
1        2  34415.153966  48.117153  6564.745018         0
2        3  57317.170063  63.108049  8020.953296         0
3        4  42709.534201  45.751972  6103.642260         0
4        5  66952.688845  18.584336  8770.099235         1
...    ...           ...        ...          ...       ...
1995  1996  59221.044874  48.518179  1926.729397         0
1996  1997  69516.127573  23.162104  3503.176156         0
1997  1998  44311.449262  28.017167  5522.786693         1
1998  1999  43756.056605  63.971796  1622.722598         0
1999  2000  69436.579552  56.152617  7378.833599         0

[2000 rows x 5 columns]

In [5]:
#verificando a quantidade de Valores Nulos na Base
#NaN = Not a Number

In [6]:
pd.isnull(df)

         id  salario  idade  emprestimo  aprovado
0     False    False  False       False     False
1     False    False  False       False     False
2     False    False  False       False     False
3     False    False  False       False     False
4     False    False  False       False     False
...     ...      ...    ...         ...       ...
1995  False    False  False       False     False
1996  False    False  False       False     False
1997  False    False  False       False     False
1998  False    False  False       False     False
1999  False    False  False       False     False

[2000 rows x 5 columns]

In [7]:
df.isnull().sum()

id            0
salario       0
idade         3
emprestimo    0
aprovado      0
dtype: int64

In [8]:
df.loc[pd.isnull(df['idade'])]

    id       salario  idade   emprestimo  aprovado
28  29  59417.805406    NaN  2082.625938         0
30  31  48528.852796    NaN  6155.784670         0
31  32  23526.302555    NaN  2862.010139         0

In [9]:
#Abaixo são descritos algumas possíveis soluções para corrigir os valores nulos na base

In [10]:
#Exemplo 01 - Remoção de um atributo na base

In [11]:
exemplo1 = df
print(exemplo1)

        id       salario      idade   emprestimo  aprovado
0        1  66155.925095  59.017015  8106.532131         0
1        2  34415.153966  48.117153  6564.745018         0
2        3  57317.170063  63.108049  8020.953296         0
3        4  42709.534201  45.751972  6103.642260         0
4        5  66952.688845  18.584336  8770.099235         1
...    ...           ...        ...          ...       ...
1995  1996  59221.044874  48.518179  1926.729397         0
1996  1997  69516.127573  23.162104  3503.176156         0
1997  1998  44311.449262  28.017167  5522.786693         1
1998  1999  43756.056605  63.971796  1622.722598         0
1999  2000  69436.579552  56.152617  7378.833599         0

[2000 rows x 5 columns]

In [12]:
exemplo1 = exemplo1.drop(['idade'], axis = 1)
print(exemplo1)

        id       salario   emprestimo  aprovado
0        1  66155.925095  8106.532131         0
1        2  34415.153966  6564.745018         0
2        3  57317.170063  8020.953296         0
3        4  42709.534201  6103.642260         0
4        5  66952.688845  8770.099235         1
...    ...           ...          ...       ...
1995  1996  59221.044874  1926.729397         0
1996  1997  69516.127573  3503.176156         0
1997  1998  44311.449262  5522.786693         1
1998  1999  43756.056605  1622.722598         0
1999  2000  69436.579552  7378.833599         0

[2000 rows x 4 columns]

In [13]:
#Exemplo 02 - Remoção dos registros da base

In [14]:
exemplo2 = df
print(exemplo2)

        id       salario      idade   emprestimo  aprovado
0        1  66155.925095  59.017015  8106.532131         0
1        2  34415.153966  48.117153  6564.745018         0
2        3  57317.170063  63.108049  8020.953296         0
3        4  42709.534201  45.751972  6103.642260         0
4        5  66952.688845  18.584336  8770.099235         1
...    ...           ...        ...          ...       ...
1995  1996  59221.044874  48.518179  1926.729397         0
1996  1997  69516.127573  23.162104  3503.176156         0
1997  1998  44311.449262  28.017167  5522.786693         1
1998  1999  43756.056605  63.971796  1622.722598         0
1999  2000  69436.579552  56.152617  7378.833599         0

[2000 rows x 5 columns]

In [15]:
exemplo2 = df.drop(df[df['idade'] < 0].index)
print(exemplo2)

        id       salario      idade   emprestimo  aprovado
0        1  66155.925095  59.017015  8106.532131         0
1        2  34415.153966  48.117153  6564.745018         0
2        3  57317.170063  63.108049  8020.953296         0
3        4  42709.534201  45.751972  6103.642260         0
4        5  66952.688845  18.584336  8770.099235         1
...    ...           ...        ...          ...       ...
1995  1996  59221.044874  48.518179  1926.729397         0
1996  1997  69516.127573  23.162104  3503.176156         0
1997  1998  44311.449262  28.017167  5522.786693         1
1998  1999  43756.056605  63.971796  1622.722598         0
1999  2000  69436.579552  56.152617  7378.833599         0

[1997 rows x 5 columns]

In [16]:
#Exemplo 03 - Descoberta da média dos valores positivos e substituição na base dos valores nulos

In [17]:
exemplo3 = df
print(exemplo3)

        id       salario      idade   emprestimo  aprovado
0        1  66155.925095  59.017015  8106.532131         0
1        2  34415.153966  48.117153  6564.745018         0
2        3  57317.170063  63.108049  8020.953296         0
3        4  42709.534201  45.751972  6103.642260         0
4        5  66952.688845  18.584336  8770.099235         1
...    ...           ...        ...          ...       ...
1995  1996  59221.044874  48.518179  1926.729397         0
1996  1997  69516.127573  23.162104  3503.176156         0
1997  1998  44311.449262  28.017167  5522.786693         1
1998  1999  43756.056605  63.971796  1622.722598         0
1999  2000  69436.579552  56.152617  7378.833599         0

[2000 rows x 5 columns]

In [18]:
exemplo3['idade'].fillna(exemplo3['idade'].mean(), inplace = True)

In [19]:
df.loc[pd.isnull(df['idade'])]

Empty DataFrame
Columns: [id, salario, idade, emprestimo, aprovado]
Index: []

In [20]:
#Exemplo 04 - [Recomendada] Descoberta da média dos valores positivos e;
#substituição na base dos valores nulos com Lib Simple Imputer

In [21]:
#Lib SkLearn para preencher valores nulos com a média dos outros valores da base
#No processo de fit, o imp converte o Dataframe para um Array.

In [22]:
#Ao final do processo, se converte de Array para Dataframe.
#Também acontece a atribuição dos valores das colunas.

In [23]:
exemplo4 = df
print(exemplo4)

        id       salario      idade   emprestimo  aprovado
0        1  66155.925095  59.017015  8106.532131         0
1        2  34415.153966  48.117153  6564.745018         0
2        3  57317.170063  63.108049  8020.953296         0
3        4  42709.534201  45.751972  6103.642260         0
4        5  66952.688845  18.584336  8770.099235         1
...    ...           ...        ...          ...       ...
1995  1996  59221.044874  48.518179  1926.729397         0
1996  1997  69516.127573  23.162104  3503.176156         0
1997  1998  44311.449262  28.017167  5522.786693         1
1998  1999  43756.056605  63.971796  1622.722598         0
1999  2000  69436.579552  56.152617  7378.833599         0

[2000 rows x 5 columns]

In [24]:
imp = SimpleImputer(missing_values=np.nan, strategy='mean')
imp = imp.fit(exemplo4)

In [25]:
exemplo4 = imp.transform(exemplo4)
print(exemplo4)

[[1.00000000e+00 6.61559251e+04 5.90170151e+01 8.10653213e+03
  0.00000000e+00]
 [2.00000000e+00 3.44151540e+04 4.81171531e+01 6.56474502e+03
  0.00000000e+00]
 [3.00000000e+00 5.73171701e+04 6.31080495e+01 8.02095330e+03
  0.00000000e+00]
 ...
 [1.99800000e+03 4.43114493e+04 2.80171669e+01 5.52278669e+03
  1.00000000e+00]
 [1.99900000e+03 4.37560566e+04 6.39717958e+01 1.62272260e+03
  0.00000000e+00]
 [2.00000000e+03 6.94365796e+04 5.61526170e+01 7.37883360e+03
  0.00000000e+00]]

In [26]:
#Após a aplicação da correção, é necessário corrigir

In [27]:
exemplo4 = pd.DataFrame(data=exemplo4)
exemplo4.columns = ['id', 'salario', 'idade', 'emprestimo', 'aprovado']

In [28]:
exemplo4.loc[pd.isnull(exemplo4['idade'])]

Empty DataFrame
Columns: [id, salario, idade, emprestimo, aprovado]
Index: []

In [29]:
print(exemplo4)

          id       salario      idade   emprestimo  aprovado
0        1.0  66155.925095  59.017015  8106.532131       0.0
1        2.0  34415.153966  48.117153  6564.745018       0.0
2        3.0  57317.170063  63.108049  8020.953296       0.0
3        4.0  42709.534201  45.751972  6103.642260       0.0
4        5.0  66952.688845  18.584336  8770.099235       1.0
...      ...           ...        ...          ...       ...
1995  1996.0  59221.044874  48.518179  1926.729397       0.0
1996  1997.0  69516.127573  23.162104  3503.176156       0.0
1997  1998.0  44311.449262  28.017167  5522.786693       1.0
1998  1999.0  43756.056605  63.971796  1622.722598       0.0
1999  2000.0  69436.579552  56.152617  7378.833599       0.0

[2000 rows x 5 columns]

In [30]:
#Aplciando as correções na Base e exportando para um arquivo .csv

In [31]:
df = pd.read_csv('D:/OneDrive/OneDrive - Etec Centro Paula Souza/Databases/credit_data_updated.csv')
print(df)

          id       salario      idade   emprestimo  aprovado
0        1.0  66155.925095  59.017015  8106.532131       0.0
1        2.0  34415.153966  48.117153  6564.745018       0.0
2        3.0  57317.170063  63.108049  8020.953296       0.0
3        4.0  42709.534201  45.751972  6103.642260       0.0
4        5.0  66952.688845  18.584336  8770.099235       1.0
...      ...           ...        ...          ...       ...
1995  1996.0  59221.044874  48.518179  1926.729397       0.0
1996  1997.0  69516.127573  23.162104  3503.176156       0.0
1997  1998.0  44311.449262  28.017167  5522.786693       1.0
1998  1999.0  43756.056605  63.971796  1622.722598       0.0
1999  2000.0  69436.579552  56.152617  7378.833599       0.0

[2000 rows x 5 columns]

In [32]:
imp = SimpleImputer(missing_values=np.nan, strategy='mean')
imp = imp.fit(df)
df = imp.transform(df)

In [33]:
print(df)

[[1.00000000e+00 6.61559251e+04 5.90170151e+01 8.10653213e+03
  0.00000000e+00]
 [2.00000000e+00 3.44151540e+04 4.81171531e+01 6.56474502e+03
  0.00000000e+00]
 [3.00000000e+00 5.73171701e+04 6.31080495e+01 8.02095330e+03
  0.00000000e+00]
 ...
 [1.99800000e+03 4.43114493e+04 2.80171669e+01 5.52278669e+03
  1.00000000e+00]
 [1.99900000e+03 4.37560566e+04 6.39717958e+01 1.62272260e+03
  0.00000000e+00]
 [2.00000000e+03 6.94365796e+04 5.61526170e+01 7.37883360e+03
  0.00000000e+00]]

In [34]:
df = pd.DataFrame(data=df)
df.columns = ['id', 'salario', 'idade', 'emprestimo', 'aprovado']

In [35]:
print(df)

          id       salario      idade   emprestimo  aprovado
0        1.0  66155.925095  59.017015  8106.532131       0.0
1        2.0  34415.153966  48.117153  6564.745018       0.0
2        3.0  57317.170063  63.108049  8020.953296       0.0
3        4.0  42709.534201  45.751972  6103.642260       0.0
4        5.0  66952.688845  18.584336  8770.099235       1.0
...      ...           ...        ...          ...       ...
1995  1996.0  59221.044874  48.518179  1926.729397       0.0
1996  1997.0  69516.127573  23.162104  3503.176156       0.0
1997  1998.0  44311.449262  28.017167  5522.786693       1.0
1998  1999.0  43756.056605  63.971796  1622.722598       0.0
1999  2000.0  69436.579552  56.152617  7378.833599       0.0

[2000 rows x 5 columns]

In [37]:
df.to_csv('D:/OneDrive/OneDrive - Etec Centro Paula Souza/Databases/credit_data_updated.csv', index=False);